In [21]:
import pandas as pd
import numpy as np
import random

## Create dummy tables in Postgres to query

Vehicle List

In [22]:
customer_list = [f"customer_{i}" for i in range(25)]
model_list = ["modelA", "modelB", "modelC"]
rows = 1000
start_date = "2010-01-01"
end_date = "2020-01-01"


def random_date(start, end):
    return start + pd.Timedelta(
        seconds=random.randint(0, int((end - start).total_seconds()))
    )


df = pd.DataFrame(
    {   "vehicle_id" : [np] 
        "customer": [np.random.choice(customer_list) for _ in range(rows)],
        "vehicle_model": [np.random.choice(model_list) for _ in range(rows)],
        "purchase_date": [
            random_date(pd.Timestamp(start_date), pd.Timestamp(end_date))
            for _ in range(rows)
        ],
    }
)

In [23]:
df

        customer vehicle_model       purchase_date
0    customer_16        modelB 2011-09-20 21:04:50
1     customer_3        modelC 2010-03-20 15:11:13
2     customer_3        modelA 2015-02-01 09:55:14
3     customer_2        modelB 2019-08-24 21:04:56
4    customer_10        modelB 2014-06-14 04:44:41
..           ...           ...                 ...
995  customer_24        modelB 2015-12-11 22:19:13
996  customer_12        modelA 2018-06-07 17:50:32
997  customer_23        modelB 2011-06-27 07:58:03
998   customer_7        modelA 2015-02-02 09:55:28
999   customer_4        modelA 2013-03-01 18:46:15

[1000 rows x 3 columns]

In [24]:
# Vehicle Details
model_a = {"propulsion": "electric", "range": 300, "price": 50000}
model_b = {"propulsion": "gas", "range": 500, "price": 40000}
model_c = {"propulsion": "diesel", "range": 700, "price": 30000}

vehicles_df = pd.DataFrame(
    {
        "vehicle_model": model_list,
        "propulsion": [
            model_a["propulsion"],
            model_b["propulsion"],
            model_c["propulsion"],
        ],
        "range": [model_a["range"], model_b["range"], model_c["range"]],
        "price": [model_a["price"], model_b["price"], model_c["price"]],
    }
)

In [25]:
vehicles_df

  vehicle_model propulsion  range  price
0        modelA   electric    300  50000
1        modelB        gas    500  40000
2        modelC     diesel    700  30000

In [26]:
# customers
country_list = ["US", "UK", "FR", "DE", "IT", "ES", "SE", "NO", "DK", "FI"]
industry_list = ["tech", "finance", "retail", "healthcare", "education", "other"]
category_list = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"]

customers_df = pd.DataFrame(
    {
        "customer": customer_list,
        "country": [np.random.choice(country_list) for _ in range(len(customer_list))],
        "industry": [
            np.random.choice(industry_list) for _ in range(len(customer_list))
        ],
        "category": [
            np.random.choice(category_list) for _ in range(len(customer_list))
        ],
    }
)

In [27]:
customers_df

       customer country    industry category
0    customer_0      IT        tech        B
1    customer_1      UK     finance        E
2    customer_2      NO  healthcare        C
3    customer_3      DK   education        I
4    customer_4      IT   education        H
5    customer_5      UK      retail        D
6    customer_6      UK     finance        C
7    customer_7      FR     finance        C
8    customer_8      ES   education        F
9    customer_9      FR      retail        B
10  customer_10      ES  healthcare        I
11  customer_11      SE   education        G
12  customer_12      IT  healthcare        B
13  customer_13      NO      retail        A
14  customer_14      ES     finance        G
15  customer_15      DE       other        I
16  customer_16      NO      retail        B
17  customer_17      ES  healthcare        D
18  customer_18      NO      retail        D
19  customer_19      UK        tech        F
20  customer_20      ES      retail        D
21  customer_21      SE       other        G
22  customer_22      DK  healthcare        B
23  customer_23      US     finance        E
24  customer_24      IT     finance        I

In [28]:
# From df create a postgres table
import sqlalchemy
from sqlalchemy import create_engine, MetaData, Table
from dotenv import dotenv_values

config = dotenv_values(".env")

In [29]:
engine = create_engine(
    f"postgresql://postgres:{config['PG_PW']}@localhost:5432/postgres"
)

### Create the three tables

In [30]:
df.to_sql(
    "sales",
    engine,
    if_exists="replace",
)
vehicles_df.to_sql(
    "vehicles",
    engine,
    if_exists="replace",
)
customers_df.to_sql(
    "customers",
    engine,
    if_exists="replace",
)

25

### Get table schema

In [31]:
from sqlalchemy import inspect

In [32]:
inspector = inspect(engine)

In [33]:
# List of tables you want to inspect
tables = ["sales", "vehicles", "customers"]

# Fetch schema information for each table
for table in tables:
    print(f"Schema for {table}:")
    for column in inspector.get_columns(table):
        print(f"  {column['name']} - {column['type']}")
    print("\n")

Schema for sales:
  index - BIGINT
  customer - TEXT
  vehicle_model - TEXT
  purchase_date - TIMESTAMP


Schema for vehicles:
  index - BIGINT
  vehicle_model - TEXT
  propulsion - TEXT
  range - BIGINT
  price - BIGINT


Schema for customers:
  index - BIGINT
  customer - TEXT
  country - TEXT
  industry - TEXT
  category - TEXT

## Merge all and create csv

In [34]:
merged_df = df.merge(vehicles_df, on="vehicle_model").merge(customers_df, on="customer")

In [35]:
merged_df

,customer,vehicle_model,purchase_date,propulsion,range,price,country,industry,category
0,customer_16,modelB,2011-09-20 21:04:50,gas,500,40000,NO,retail,B
1,customer_16,modelB,2011-09-01 09:04:59,gas,500,40000,NO,retail,B
2,customer_16,modelB,2010-05-28 20:49:23,gas,500,40000,NO,retail,B
3,customer_16,modelB,2012-09-19 05:43:21,gas,500,40000,NO,retail,B
4,customer_16,modelB,2011-08-23 15:05:45,gas,500,40000,NO,retail,B
...,...,...,...,...,...,...,...,...,...
995,customer_19,modelA,2011-11-04 21:49:46,electric,300,50000,UK,tech,F
996,customer_19,modelA,2017-07-08 22:24:49,electric,300,50000,UK,tech,F
997,customer_19,modelA,2018-12-27 05:56:48,electric,300,50000,UK,tech,F
998,customer_19,modelA,2010-10-09 00:43:32,electric,300,50000,UK,tech,F
999,customer_19,modelA,2015-06-06 21:08:47,electric,300,50000,UK,tech,F

In [37]:
merged_df.to_csv("sales.csv")